frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/twim.h
/**
 * \file
 *
 * \brief Component description for TWIM
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_TWIM_COMPONENT_
#define _SAM4L_TWIM_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TWIM */
/* ========================================================================== */
/** \addtogroup SAM4L_TWIM Two-wire Master Interface */
/*@{*/

#define TWIM_I7535
#define REV_TWIM                    0x120

/* -------- TWIM_CR : (TWIM Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MEN:1;            /*!< bit:      0  Master Enable                      */
    uint32_t MDIS:1;           /*!< bit:      1  Master Disable                     */
    uint32_t :2;               /*!< bit:  2.. 3  Reserved                           */
    uint32_t SMEN:1;           /*!< bit:      4  SMBus Enable                       */
    uint32_t SMDIS:1;          /*!< bit:      5  SMBus Disable                      */
    uint32_t :1;               /*!< bit:      6  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      7  Software Reset                     */
    uint32_t STOP:1;           /*!< bit:      8  Stop the current transfer          */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_CR_OFFSET              0x00         /**< \brief (TWIM_CR offset) Control Register */
#define TWIM_CR_RESETVALUE          _U(0x00000000); /**< \brief (TWIM_CR reset_value) Control Register */

#define TWIM_CR_MEN_Pos             0            /**< \brief (TWIM_CR) Master Enable */
#define TWIM_CR_MEN                 (_U(0x1) << TWIM_CR_MEN_Pos)
#define TWIM_CR_MDIS_Pos            1            /**< \brief (TWIM_CR) Master Disable */
#define TWIM_CR_MDIS                (_U(0x1) << TWIM_CR_MDIS_Pos)
#define TWIM_CR_SMEN_Pos            4            /**< \brief (TWIM_CR) SMBus Enable */
#define TWIM_CR_SMEN                (_U(0x1) << TWIM_CR_SMEN_Pos)
#define TWIM_CR_SMDIS_Pos           5            /**< \brief (TWIM_CR) SMBus Disable */
#define TWIM_CR_SMDIS               (_U(0x1) << TWIM_CR_SMDIS_Pos)
#define TWIM_CR_SWRST_Pos           7            /**< \brief (TWIM_CR) Software Reset */
#define TWIM_CR_SWRST               (_U(0x1) << TWIM_CR_SWRST_Pos)
#define TWIM_CR_STOP_Pos            8            /**< \brief (TWIM_CR) Stop the current transfer */
#define TWIM_CR_STOP                (_U(0x1) << TWIM_CR_STOP_Pos)
#define TWIM_CR_MASK                _U(0x000001B3) /**< \brief (TWIM_CR) MASK Register */

/* -------- TWIM_CWGR : (TWIM Offset: 0x04) (R/W 32) Clock Waveform Generator Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LOW:8;            /*!< bit:  0.. 7  Clock Low Cycles                   */
    uint32_t HIGH:8;           /*!< bit:  8..15  Clock High Cycles                  */
    uint32_t STASTO:8;         /*!< bit: 16..23  START and STOP Cycles              */
    uint32_t DATA:4;           /*!< bit: 24..27  Data Setup and Hold Cycles         */
    uint32_t EXP:3;            /*!< bit: 28..30  Clock Prescaler                    */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_CWGR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_CWGR_OFFSET            0x04         /**< \brief (TWIM_CWGR offset) Clock Waveform Generator Register */
#define TWIM_CWGR_RESETVALUE        _U(0x00000000); /**< \brief (TWIM_CWGR reset_value) Clock Waveform Generator Register */

#define TWIM_CWGR_LOW_Pos           0            /**< \brief (TWIM_CWGR) Clock Low Cycles */
#define TWIM_CWGR_LOW_Msk           (_U(0xFF) << TWIM_CWGR_LOW_Pos)
#define TWIM_CWGR_LOW(value)        (TWIM_CWGR_LOW_Msk & ((value) << TWIM_CWGR_LOW_Pos))
#define TWIM_CWGR_HIGH_Pos          8            /**< \brief (TWIM_CWGR) Clock High Cycles */
#define TWIM_CWGR_HIGH_Msk          (_U(0xFF) << TWIM_CWGR_HIGH_Pos)
#define TWIM_CWGR_HIGH(value)       (TWIM_CWGR_HIGH_Msk & ((value) << TWIM_CWGR_HIGH_Pos))
#define TWIM_CWGR_STASTO_Pos        16           /**< \brief (TWIM_CWGR) START and STOP Cycles */
#define TWIM_CWGR_STASTO_Msk        (_U(0xFF) << TWIM_CWGR_STASTO_Pos)
#define TWIM_CWGR_STASTO(value)     (TWIM_CWGR_STASTO_Msk & ((value) << TWIM_CWGR_STASTO_Pos))
#define TWIM_CWGR_DATA_Pos          24           /**< \brief (TWIM_CWGR) Data Setup and Hold Cycles */
#define TWIM_CWGR_DATA_Msk          (_U(0xF) << TWIM_CWGR_DATA_Pos)
#define TWIM_CWGR_DATA(value)       (TWIM_CWGR_DATA_Msk & ((value) << TWIM_CWGR_DATA_Pos))
#define TWIM_CWGR_EXP_Pos           28           /**< \brief (TWIM_CWGR) Clock Prescaler */
#define TWIM_CWGR_EXP_Msk           (_U(0x7) << TWIM_CWGR_EXP_Pos)
#define TWIM_CWGR_EXP(value)        (TWIM_CWGR_EXP_Msk & ((value) << TWIM_CWGR_EXP_Pos))
#define TWIM_CWGR_MASK              _U(0x7FFFFFFF) /**< \brief (TWIM_CWGR) MASK Register */

/* -------- TWIM_SMBTR : (TWIM Offset: 0x08) (R/W 32) SMBus Timing Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TLOWS:8;          /*!< bit:  0.. 7  Slave Clock stretch maximum cycles */
    uint32_t TLOWM:8;          /*!< bit:  8..15  Master Clock stretch maximum cycles */
    uint32_t THMAX:8;          /*!< bit: 16..23  Clock High maximum cycles          */
    uint32_t :4;               /*!< bit: 24..27  Reserved                           */
    uint32_t EXP:4;            /*!< bit: 28..31  SMBus Timeout Clock prescaler      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_SMBTR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_SMBTR_OFFSET           0x08         /**< \brief (TWIM_SMBTR offset) SMBus Timing Register */
#define TWIM_SMBTR_RESETVALUE       _U(0x00000000); /**< \brief (TWIM_SMBTR reset_value) SMBus Timing Register */

#define TWIM_SMBTR_TLOWS_Pos        0            /**< \brief (TWIM_SMBTR) Slave Clock stretch maximum cycles */
#define TWIM_SMBTR_TLOWS_Msk        (_U(0xFF) << TWIM_SMBTR_TLOWS_Pos)
#define TWIM_SMBTR_TLOWS(value)     (TWIM_SMBTR_TLOWS_Msk & ((value) << TWIM_SMBTR_TLOWS_Pos))
#define TWIM_SMBTR_TLOWM_Pos        8            /**< \brief (TWIM_SMBTR) Master Clock stretch maximum cycles */
#define TWIM_SMBTR_TLOWM_Msk        (_U(0xFF) << TWIM_SMBTR_TLOWM_Pos)
#define TWIM_SMBTR_TLOWM(value)     (TWIM_SMBTR_TLOWM_Msk & ((value) << TWIM_SMBTR_TLOWM_Pos))
#define TWIM_SMBTR_THMAX_Pos        16           /**< \brief (TWIM_SMBTR) Clock High maximum cycles */
#define TWIM_SMBTR_THMAX_Msk        (_U(0xFF) << TWIM_SMBTR_THMAX_Pos)
#define TWIM_SMBTR_THMAX(value)     (TWIM_SMBTR_THMAX_Msk & ((value) << TWIM_SMBTR_THMAX_Pos))
#define TWIM_SMBTR_EXP_Pos          28           /**< \brief (TWIM_SMBTR) SMBus Timeout Clock prescaler */
#define TWIM_SMBTR_EXP_Msk          (_U(0xF) << TWIM_SMBTR_EXP_Pos)
#define TWIM_SMBTR_EXP(value)       (TWIM_SMBTR_EXP_Msk & ((value) << TWIM_SMBTR_EXP_Pos))
#define TWIM_SMBTR_MASK             _U(0xF0FFFFFF) /**< \brief (TWIM_SMBTR) MASK Register */

