frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/twim.h
/* -------- TWIM_SRR : (TWIM Offset: 0x3C) (R/W 32) Slew Rate Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DADRIVEL:3;       /*!< bit:  0.. 2  Data Drive Strength LOW            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t DASLEW:2;         /*!< bit:  8.. 9  Data Slew Limit                    */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t CLDRIVEL:3;       /*!< bit: 16..18  Clock Drive Strength LOW           */
    uint32_t :5;               /*!< bit: 19..23  Reserved                           */
    uint32_t CLSLEW:2;         /*!< bit: 24..25  Clock Slew Limit                   */
    uint32_t :2;               /*!< bit: 26..27  Reserved                           */
    uint32_t FILTER:2;         /*!< bit: 28..29  Input Spike Filter Control         */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_SRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_SRR_OFFSET             0x3C         /**< \brief (TWIM_SRR offset) Slew Rate Register */
#define TWIM_SRR_RESETVALUE         _U(0x00000000); /**< \brief (TWIM_SRR reset_value) Slew Rate Register */

#define TWIM_SRR_DADRIVEL_Pos       0            /**< \brief (TWIM_SRR) Data Drive Strength LOW */
#define TWIM_SRR_DADRIVEL_Msk       (_U(0x7) << TWIM_SRR_DADRIVEL_Pos)
#define TWIM_SRR_DADRIVEL(value)    (TWIM_SRR_DADRIVEL_Msk & ((value) << TWIM_SRR_DADRIVEL_Pos))
#define TWIM_SRR_DASLEW_Pos         8            /**< \brief (TWIM_SRR) Data Slew Limit */
#define TWIM_SRR_DASLEW_Msk         (_U(0x3) << TWIM_SRR_DASLEW_Pos)
#define TWIM_SRR_DASLEW(value)      (TWIM_SRR_DASLEW_Msk & ((value) << TWIM_SRR_DASLEW_Pos))
#define TWIM_SRR_CLDRIVEL_Pos       16           /**< \brief (TWIM_SRR) Clock Drive Strength LOW */
#define TWIM_SRR_CLDRIVEL_Msk       (_U(0x7) << TWIM_SRR_CLDRIVEL_Pos)
#define TWIM_SRR_CLDRIVEL(value)    (TWIM_SRR_CLDRIVEL_Msk & ((value) << TWIM_SRR_CLDRIVEL_Pos))
#define TWIM_SRR_CLSLEW_Pos         24           /**< \brief (TWIM_SRR) Clock Slew Limit */
#define TWIM_SRR_CLSLEW_Msk         (_U(0x3) << TWIM_SRR_CLSLEW_Pos)
#define TWIM_SRR_CLSLEW(value)      (TWIM_SRR_CLSLEW_Msk & ((value) << TWIM_SRR_CLSLEW_Pos))
#define TWIM_SRR_FILTER_Pos         28           /**< \brief (TWIM_SRR) Input Spike Filter Control */
#define TWIM_SRR_FILTER_Msk         (_U(0x3) << TWIM_SRR_FILTER_Pos)
#define TWIM_SRR_FILTER(value)      (TWIM_SRR_FILTER_Msk & ((value) << TWIM_SRR_FILTER_Pos))
#define TWIM_SRR_MASK               _U(0x33070307) /**< \brief (TWIM_SRR) MASK Register */

/* -------- TWIM_HSSRR : (TWIM Offset: 0x40) (R/W 32) HS-mode Slew Rate Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DADRIVEL:3;       /*!< bit:  0.. 2  Data Drive Strength LOW            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t DASLEW:2;         /*!< bit:  8.. 9  Data Slew Limit                    */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t CLDRIVEL:3;       /*!< bit: 16..18  Clock Drive Strength LOW           */
    uint32_t :1;               /*!< bit:     19  Reserved                           */
    uint32_t CLDRIVEH:2;       /*!< bit: 20..21  Clock Drive Strength HIGH          */
    uint32_t :2;               /*!< bit: 22..23  Reserved                           */
    uint32_t CLSLEW:2;         /*!< bit: 24..25  Clock Slew Limit                   */
    uint32_t :2;               /*!< bit: 26..27  Reserved                           */
    uint32_t FILTER:2;         /*!< bit: 28..29  Input Spike Filter Control         */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_HSSRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_HSSRR_OFFSET           0x40         /**< \brief (TWIM_HSSRR offset) HS-mode Slew Rate Register */
#define TWIM_HSSRR_RESETVALUE       _U(0x00000000); /**< \brief (TWIM_HSSRR reset_value) HS-mode Slew Rate Register */

#define TWIM_HSSRR_DADRIVEL_Pos     0            /**< \brief (TWIM_HSSRR) Data Drive Strength LOW */
#define TWIM_HSSRR_DADRIVEL_Msk     (_U(0x7) << TWIM_HSSRR_DADRIVEL_Pos)
#define TWIM_HSSRR_DADRIVEL(value)  (TWIM_HSSRR_DADRIVEL_Msk & ((value) << TWIM_HSSRR_DADRIVEL_Pos))
#define TWIM_HSSRR_DASLEW_Pos       8            /**< \brief (TWIM_HSSRR) Data Slew Limit */
#define TWIM_HSSRR_DASLEW_Msk       (_U(0x3) << TWIM_HSSRR_DASLEW_Pos)
#define TWIM_HSSRR_DASLEW(value)    (TWIM_HSSRR_DASLEW_Msk & ((value) << TWIM_HSSRR_DASLEW_Pos))
#define TWIM_HSSRR_CLDRIVEL_Pos     16           /**< \brief (TWIM_HSSRR) Clock Drive Strength LOW */
#define TWIM_HSSRR_CLDRIVEL_Msk     (_U(0x7) << TWIM_HSSRR_CLDRIVEL_Pos)
#define TWIM_HSSRR_CLDRIVEL(value)  (TWIM_HSSRR_CLDRIVEL_Msk & ((value) << TWIM_HSSRR_CLDRIVEL_Pos))
#define TWIM_HSSRR_CLDRIVEH_Pos     20           /**< \brief (TWIM_HSSRR) Clock Drive Strength HIGH */
#define TWIM_HSSRR_CLDRIVEH_Msk     (_U(0x3) << TWIM_HSSRR_CLDRIVEH_Pos)
#define TWIM_HSSRR_CLDRIVEH(value)  (TWIM_HSSRR_CLDRIVEH_Msk & ((value) << TWIM_HSSRR_CLDRIVEH_Pos))
#define TWIM_HSSRR_CLSLEW_Pos       24           /**< \brief (TWIM_HSSRR) Clock Slew Limit */
#define TWIM_HSSRR_CLSLEW_Msk       (_U(0x3) << TWIM_HSSRR_CLSLEW_Pos)
#define TWIM_HSSRR_CLSLEW(value)    (TWIM_HSSRR_CLSLEW_Msk & ((value) << TWIM_HSSRR_CLSLEW_Pos))
#define TWIM_HSSRR_FILTER_Pos       28           /**< \brief (TWIM_HSSRR) Input Spike Filter Control */
#define TWIM_HSSRR_FILTER_Msk       (_U(0x3) << TWIM_HSSRR_FILTER_Pos)
#define TWIM_HSSRR_FILTER(value)    (TWIM_HSSRR_FILTER_Msk & ((value) << TWIM_HSSRR_FILTER_Pos))
#define TWIM_HSSRR_MASK             _U(0x33370307) /**< \brief (TWIM_HSSRR) MASK Register */

/** \brief TWIM hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  TWIM_CR_Type              CR;          /**< \brief Offset: 0x00 ( /W 32) Control Register */
  __IO TWIM_CWGR_Type            CWGR;        /**< \brief Offset: 0x04 (R/W 32) Clock Waveform Generator Register */
  __IO TWIM_SMBTR_Type           SMBTR;       /**< \brief Offset: 0x08 (R/W 32) SMBus Timing Register */
  __IO TWIM_CMDR_Type            CMDR;        /**< \brief Offset: 0x0C (R/W 32) Command Register */
  __IO TWIM_NCMDR_Type           NCMDR;       /**< \brief Offset: 0x10 (R/W 32) Next Command Register */
  __I  TWIM_RHR_Type             RHR;         /**< \brief Offset: 0x14 (R/  32) Receive Holding Register */
  __O  TWIM_THR_Type             THR;         /**< \brief Offset: 0x18 ( /W 32) Transmit Holding Register */
  __I  TWIM_SR_Type              SR;          /**< \brief Offset: 0x1C (R/  32) Status Register */
  __O  TWIM_IER_Type             IER;         /**< \brief Offset: 0x20 ( /W 32) Interrupt Enable Register */
  __O  TWIM_IDR_Type             IDR;         /**< \brief Offset: 0x24 ( /W 32) Interrupt Disable Register */
  __I  TWIM_IMR_Type             IMR;         /**< \brief Offset: 0x28 (R/  32) Interrupt Mask Register */
  __O  TWIM_SCR_Type             SCR;         /**< \brief Offset: 0x2C ( /W 32) Status Clear Register */
  __I  TWIM_PR_Type              PR;          /**< \brief Offset: 0x30 (R/  32) Parameter Register */
  __I  TWIM_VR_Type              VR;          /**< \brief Offset: 0x34 (R/  32) Version Register */
  __IO TWIM_HSCWGR_Type          HSCWGR;      /**< \brief Offset: 0x38 (R/W 32) HS-mode Clock Waveform Generator */
  __IO TWIM_SRR_Type             SRR;         /**< \brief Offset: 0x3C (R/W 32) Slew Rate Register */
  __IO TWIM_HSSRR_Type           HSSRR;       /**< \brief Offset: 0x40 (R/W 32) HS-mode Slew Rate Register */
 } bf;
 struct {
  WoReg   TWIM_CR;            /**< \brief (TWIM Offset: 0x00) Control Register */
  RwReg   TWIM_CWGR;          /**< \brief (TWIM Offset: 0x04) Clock Waveform Generator Register */
  RwReg   TWIM_SMBTR;         /**< \brief (TWIM Offset: 0x08) SMBus Timing Register */
  RwReg   TWIM_CMDR;          /**< \brief (TWIM Offset: 0x0C) Command Register */
  RwReg   TWIM_NCMDR;         /**< \brief (TWIM Offset: 0x10) Next Command Register */
  RoReg   TWIM_RHR;           /**< \brief (TWIM Offset: 0x14) Receive Holding Register */
  WoReg   TWIM_THR;           /**< \brief (TWIM Offset: 0x18) Transmit Holding Register */
  RoReg   TWIM_SR;            /**< \brief (TWIM Offset: 0x1C) Status Register */
  WoReg   TWIM_IER;           /**< \brief (TWIM Offset: 0x20) Interrupt Enable Register */
  WoReg   TWIM_IDR;           /**< \brief (TWIM Offset: 0x24) Interrupt Disable Register */
  RoReg   TWIM_IMR;           /**< \brief (TWIM Offset: 0x28) Interrupt Mask Register */
  WoReg   TWIM_SCR;           /**< \brief (TWIM Offset: 0x2C) Status Clear Register */
  RoReg   TWIM_PR;            /**< \brief (TWIM Offset: 0x30) Parameter Register */
  RoReg   TWIM_VR;            /**< \brief (TWIM Offset: 0x34) Version Register */
  RwReg   TWIM_HSCWGR;        /**< \brief (TWIM Offset: 0x38) HS-mode Clock Waveform Generator */
  RwReg   TWIM_SRR;           /**< \brief (TWIM Offset: 0x3C) Slew Rate Register */
  RwReg   TWIM_HSSRR;         /**< \brief (TWIM Offset: 0x40) HS-mode Slew Rate Register */
 } reg;
} Twim;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_TWIM_COMPONENT_ */
